[
    {
        "comment": "Watched, gave it a like",
        "date": "2024-02-25T07:03:24Z"
    },
    {
        "comment": "Do you cover remodels this was very good well explained for the average person",
        "date": "2023-04-22T12:19:21Z"
    },
    {
        "comment": "Helpful.  Thanks",
        "date": "2022-11-06T18:12:41Z"
    },
    {
        "comment": "General Contractor,  Contractor,  Carpenter here; Your videos &amp; explanations are Superior!  Your ability to explain in such simple terms demonstrates your extensive understanding/knowledge of your subjects. It&#39;s refreshing to see someone else with passion &amp; a sincere desire to help &amp; share their knowledge with others.",
        "date": "2022-05-02T22:54:15Z"
    },
    {
        "comment": "A small note about a common mistake: there is no such thing in English as &quot;..off of&quot;; only a single &quot;..off&quot;. &quot;Get off my head&quot;, &quot;Get off the roof&quot; etc. not &quot;get off of my head&quot;.",
        "date": "2022-03-07T23:02:59Z"
    },
    {
        "comment": "Not explained.   Just named.",
        "date": "2021-12-03T17:10:01Z"
    },
    {
        "comment": "Thank you!",
        "date": "2021-09-01T21:05:02Z"
    },
    {
        "comment": "I liked the video but I was laughing so hard when you said truss roofs are strong; clearly not from New England. Every heavy winter that comes along all the buildings that have roof collapses are the ones with that truss crap. Otherwise very informative video 👍🏻",
        "date": "2021-06-15T12:11:16Z"
    },
    {
        "comment": "Very interesting. Here in Australia our timber framed homes use pretty much all the same terminology the only difference is really when it comes to sheathing the house. We generally do not &#39;sheath&#39; the whole house in ply board prior to wrapping. We usually install what is called bracing ply in key locations (designated by the engineering) around the house to brace it up and stop movement. We also install cyclone rods which is threaded rod that extends from the foundation to the top plate which assists in holding the roof down during high winds. Furthermore generally all framing in the house is treated timber, not just the mud sill, this helps prevent rot and termites as the houses are generally built to breath not insulate.",
        "date": "2021-05-07T03:17:42Z"
    },
    {
        "comment": "Gonna have to watch this several time :)",
        "date": "2021-03-07T05:33:59Z"
    }
]